checkout/tests/artillery/scenarios/integration.scenarios.yaml
config:
  phases:
    - duration: 1
      arrivalRate: 1
scenarios:
  - name: "Integration"
    flow:
      - function: "defineVariables"
      - log: "Login"
      - function: "auth"

      - log: "Business Enable"
      - patch:
          url: "{{ authUrl }}/api/business/{{ businessId }}/enable"
          afterResponse: "setAccessToken"
          headers:
            authorization: "Bearer {{ accessToken }}"
            user-agent: "{{ userAgent }}"

      - log: "GET /api/integration"
      - get:
          url: "/api/integration"
          headers:
            authorization: "Bearer {{ accessToken }}"
            user-agent: "{{ userAgent }}"

      - log: "POST /api/integration"
      - post:
          url: "/api/integration"
          headers:
            authorization: "Bearer {{ accessToken }}"
            user-agent: "{{ userAgent }}"
          json:
            default: False
            name: "{{ integrationName }}"
            category: "{{ category }}"

      - log: "GET /api/integration/{{ integrationName }}"
      - get:
          url: "/api/integration/{{ integrationName }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
            user-agent: "{{ userAgent }}"

      - log: "GET /api/integration/category/{{ category }}"
      - get:
          url: "/api/integration/category/{{ category }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
            user-agent: "{{ userAgent }}"